{
  "Triceps": [
    {
      "Band Back Fly": {
        "level": "Beginner",
        "how_to_do_it": " The band back fly exercise will help strengthen your upper back and help improve your posture.\n\r\nSteps : \n\r\n1.) Start off by placing a resistance band mid-waist high either around a post or an exercise machine.\n\r\n2.) Stand in front of the machine or post, keeping your feet together, abs tight and knees slightly bent so that you feel a tension in the band.\n\r\n3.) Slowly and in a controlled manner, bring your arms back until they are parallel with your sides.\n\r\n4.) Once you reach the final position, hold for a count while squeezing your back muscles, then return back to the starting position.\n\r\nTips :\n\r\n1.) Make sure that you are able to use a band that you are able to perform the exercise with."
      }
    },
    {
      "Barbell Bench Press (Close Grip)": {
        "level": "Beginner",
        "how_to_do_it": " This exercise of the bench press is a variation where the individual uses a narrow grip to put pressure on the triceps.\n\r\nSteps :\n\r\n1.) Start off lying with your back flat on a bench with your feet flat on the floor in front of you.\n\r\n2.) Grab the bar with a narrow grip keeping your hands close enough so that your thumbs are able to touch.\n\r\n3.) Then lift the barbell off of the rack and hold it above your chest as this will be your starting position.\n\r\n4.) Lower the barbell towards your chest, stopping so that the bar is close to touching you and hold for a second.\n\r\n5.) Push the bar back up to the starting position and repeat for as many reps and sets as desired.\n\r\nTips :\n\r\n1.) Prevent from bouncing the barbell off of your chest as that is performing the exercise incorrectly and could lead to injury."
      }
    },
    {
      "Barbell Close Grip Press": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by sitting up straight on the end of a flat bench with feet in front of you, while holding a weighted barbell on your knees.\n\r\n2.) Elevate the bar overhead and this will be your starting position.\n\r\n3.) Slowly lower the bar behind your head, until you feel a stretch, squeeze your triceps, and hold for a count.\n\r\n4.) Return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Incline Bench Press (Close Grip)": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying back on an incline bench press with your feet flat on the floor in front of you, grabbing the barbell with a close overhand grip.\n\r\n2.) Remove the barbell from the rack and elevate it over your chest. \n\r\n3.) Keep your elbows tucked in at your sides and lower the barbell down to your middle chest without touching.\n\r\n4.) Squeeze your triceps and hold for a count.\n\r\n5.) Return back to the starting position.\n\r\n6.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell JM Press": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) To begin this exercise; start off placing your back flat upon a bench and position yourself just as if you were to perform a close grip bench press. \n\r\n2.) The most important part is to make sure that the bar is above the upper part of your chest.\n\r\n3.) The lower the bar down towards your chest just as if you were performing a lying triceps extension. \n\r\n4.) Then use your triceps to push the bar back up into position.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Overhead Tricep Extension": {
        "level": "Beginner",
        "how_to_do_it": " The barbell standing overhead tricep extension is a double arm barbell version of the behind the neck triceps exercise that targets the tricep muscle.\n\r\nSteps : \n\r\n1.) Start by standing with your feet shoulder-width apart, your back straight and your abs drawn in.\n\r\n2.) Hold a barbell or EZ Curl bar about 6-8 inches apart with your palms facing up.\n\r\n3.) Raise the bar over your head and slowly lower the bar in an arc behind your head, towards your back and hold for a count.\n\r\n4.) Slowly bring the bar back up to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Pin Press": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by setting up a flat bench between a power rack, setting the pins to about chest level and place the bar onto the pins.\n\r\n2.) Lay flat on your back on the bench with the bar directly above your chest, then tuck your feet underneath you, arch your back and then drive the bar up with as much force as possible, feeling a stretch within your triceps.\n\r\n3.) Hold the bar at the peak position for a count then return back to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Rear Tricep Extension": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying down with your back on a flat bench, feet on the floor in front of you, holding a weighted barbell above your head.\n\r\n2.) Keep your elbows fixed in one position, slowly lower the bar down until it is almost touching the top of your head, squeezing your triceps and hold for a count.\n\r\n3.) Return back to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Reverse Grip Tricep Extension": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying on an incline bench with your feet flat on the floor, holding a barbell with both hands over your eyes with palms facing inward.\n\r\n2.) Slowly lower the barbell towards the top of your head feeling tension in your triceps, hold this position for a count and return back to the start.\n\r\n3.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Reverse Tricep Bench Press": {
        "level": "Intermediate",
        "how_to_do_it": " The barbell reverse triceps bench press exercise is a version of the bench press that specifically isolates the tricep muscles.\n\r\nSteps : \n\r\n1.) Start off lying on a flat bench with your head at one end and your feet placed firmly on the floor at the other end.\n\r\n2.) Grabbing a barbell with a reverse grip about 16 inches apart and Move the bar over your chest.\n\r\n3.) Extend your arms fully raising the bar fully and then lower the bar to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    }
  ],
  "Chest": [
    {
      "Assisted Chest Stretch": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) In this stretch you will need a partner behind you to assist.\n\r\n2.) Start off by sitting upright on the floor with your partner behind you, placing your hands behind your head and legs extended out in front of you with a slight bend in the knees.\n\r\n3.) Have your partner hold your elbows, then try and pull your elbows from behind your head for about 15 to 30 seconds then release.\n\r\n4.) Then afterwards have your partner pull back on your elbows again but easily this time to help stretch out the chest muscles."
      }
    },
    {
      "Back Stretch": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start off by standing up straight with your arms at your side and feet shoulder width apart.\n\r\n2.) Then place your hands on your lower back, fingers pointed downward and try to extend your arms back and touch your elbows.\n\r\n3.) Return back to the starting position and repeat for as many reps as possible."
      }
    },
    {
      "Band Bench Press": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) To begin this exercise; start off with placing a band under the leg of the bench where your head will be resting.\n\r\n2.) Following this placement, lie down flat on a flat bench and push your arms forward so that you have the handles in front of you at your shoulder width.\n\r\n3.) Then bring the handles down as if you are doing a normal barbell bench press. \n\r\n4.) Right before you are about to touch your chest, squeeze your pectorals and hold the position for a few seconds and return back to the starting position.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Band Cross-Over": {
        "level": "Beginner",
        "how_to_do_it": " This exercise uses unique and variable resistance to target your chest and biceps.\n\r\nSteps :\n\r\n1.) Take a resistance band and wrap it around a straight pole or the post of an exercise machine. Keeping the band at around chest level, face away from the post and hold the handles in each hand, spreading them out to your sides.\n\r\n2.) Once you have wrapped the band around the pole, step back until you feel resistance, standing with your feet shoulder-width apart, and keep your knees bent and abs tight.\n\r\n3.) To perform the exercise, slowly allow your hands to come in towards each other, keeping your arms extended out in front of you, until you feel a stretch in your chest.\n\r\n4.) Hold this position for a few seconds then return back to the starting position with your hands extended out and handles spread out at your sides.\n\n\r\nTips : \n\r\n1.) By using a straight pole, it provides stability to perform the exercise and less likely to slip thus injuring yourself.\n\r\n2.) You are able to vary the resistance by either stepping towards or away from where the band is wrapped around."
      }
    },
    {
      "Barbell Bench Press": {
        "level": "Beginner",
        "how_to_do_it": " Bench press is a great exercise for building a powerful chest.\n\r\nThe bench press is one of the power exercises, known to be very effective for building body mass. Learning how to do a proper bench press is well worth the effort.\n\n\r\nSteps : \n\r\n1.) Lie with your back flat on a bench with your feet firmly on the ground and the bar resting on the bench’s rack.\n\r\n2.) Slowly lift the bar off the rack and hold it above your chest as this will be the starting position.\n\r\n3.) Then lower the bar down until it is slightly above your chest, making sure that it doesn't touch or slam against your chest.\n\r\n4.) Hold this position briefly and make sure you have complete control of the bar, then raise it back up to the starting postion.\n\r\n3.) Place the bar on the rack and that will complete your set.\n\r\nTips :\n\r\n1.) By changing the width of the grip on the bar will change the focus and targeting of the exercise. Using a medium grip is the most common grip on the bar which is slightly wider than shoulder-width that is typically marked on the bar.\n\r\n2.) Using a spotter while performing this exercise is essential to make sure that the bar doesn't drop onto your chest and a spotter can provide motivation to lift more weight.\n\r\n3.) The most important thing about the bench press exercise is using a weight that you can manage while maintaining proper form. Many individuals try to lift more weight than they can manage which results in injuring and incorrectly performing the exercise."
      }
    },
    {
      "Barbell Bench Press (Wide Grip)": {
        "level": "Beginner",
        "how_to_do_it": " The barbell wide grip bench press exercise is a great exercise for the pectoral muscles and uses a wider grip to focus upon the outer portion of the chest.\n\r\nSteps : \n\r\n1.) Lie flat on a bench with your feet flat on the floor.\n\r\n1.) Begin with your back flat on a bench with your feet flat on the floor in front of you and grabbing onto the barbell with a wider than shoulder-width grip as this will be your starting position.\n\r\n2.) Lift the bar up and off of the rack, bring it over your chest and slowly lower it until it is just above your body and you feel a stretch in your chest muscles.\n\r\n3.) Hold for a count then extend your arms upward and raise the bar straight up over your chest.\n\r\n4.) Repeat for as many reps and sets as desired.\n\r\nTips : \n\r\n1.) Keep your abs drawn in and your back flat on the bench throughout this exercise.\n\r\n2.) Refrain from bouncing the barbell off of your chest as this is improper form and can lead to injury."
      }
    },
    {
      "Barbell Decline Bench Press": {
        "level": "Beginner",
        "how_to_do_it": " This version of the bench press exercise utilizes a decline bench so that the lower part of the chest is targeted.\n\r\nSteps : \n\r\n1.) Start off lying on a decline bench so that your head is lower than your feet.\n\r\n2.) Grab onto the barbell with an overhand shoulder-width grip and hold it directly above your chest as this will be your starting position.\n\r\n3.) Then slowly lower the bar until it is just above your chest, stop and hold for a second then return back to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired.\n\r\nTips : \n\r\n1.) Concentrate on using your chest for this bench press. You should feel as if the lifting is coming from your elbows.\n\r\n1.) Make sure that your feet are flat on the floor and you are balanced so that the bar does not drop on your chest.\n\r\n2.) Use a weight that you are able to balance and manage.\n\r\n3.) When stopping the barbell on the downward motion, make sure that you stop the barbell slightly above your chest so that it doesn't bounce or touch your chest."
      }
    },
    {
      "Barbell Decline Bench Press (Reverse Grip)": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying flat on your back on a decline bench, feet on the rested underneath the pads and hands holding dumbbells in a underhand reverse grip at the sides of your chest.\n\r\n2.) Slowly push the dumbbells straight up above your chest, squeezing your pecs and hold for a count.\n\r\n3.) Return back to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Decline Bench Press (Wide Grip)": {
        "level": "Beginner",
        "how_to_do_it": " The barbell wide grip decline bench press is a great exercise to work the lower portion of the pectoral muscles and also uses a wider grip to focus upon the outer portion of the chest.\n\r\nSteps :\n\r\n1.) Start off lying on a decline bench with your head positioned lower than your feet and reach up grabbing the barbell with a wider than shoulder-width as this will be your starting position.\n\r\n2.) Slowly lift the barbell up off of the rack, bring it just over your chest and lower it until it is above the lower portion of your chest and you feel a stretch in your pectoral muscles.\n\r\n3.) Hold this position for a count then return back up to the start.\n\r\n4.) Repeat for as many reps and sets as desired.\n\r\nTips : \n\r\n1.) Keep your abs drawn in and your back flat on the bench throughout this exercise.\n\r\n2.) Refrain from bouncing the barbell off of your chest as this is improper form and can lead to injury.\n\r\n3.) Make sure the you are using a bench that you can maintain your balance through the exercise."
      }
    },
    {
      "Barbell Decline Pullover": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by lying with your back flat on a decline bench, holding a weighted barbell above your chest and arms fully extended out in front of you.\n\r\n2.) Then slowly move the barbell back and down behind you so that your arms stay fully extended but the barbell is behind your head and body about to touch the floor.\n\r\n3.) Squeeze your shoulder and chest muscles on the way down and hold for a count.\n\r\n4.) Return the barbell back up to the starting position, keeping your arms fully extended.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    }
  ],
  "Shoulders": [
    {
      "Arm Circles": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by standing up straight with your feet shoulder width apart and your arms extended out to your sides so that you create a \"T\" shape and should be parallel to the floor.\n\r\n2.) Slowly make circles with your arms feeling a stretch in your shoulders as you continue to rotate in a circular motion.\n\r\n3.) Continue this motion for 10 to 20 seconds then return to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Band Lateral Raise": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; stand on a band so that it is evenly distributed to be pulled by each arm.\n\r\n2.) Grab the handles and keep you arms down and rested at your side.\n\r\n3.) Then using your shoulders, raise the hands above your sides so that they are at shoulder level then lower the handles back down to the starting position.\n\r\n4.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Band Shoulder Press": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; stand on a band so that it is evenly distributed to be pulled by each arm.\n\r\n2.) Grab the handles and press your arms up so that they are at shoulder level.\n\r\n3.) Then using your shoulders, raise the hands above your sides so that they are above your head then lower the handles back down to the starting position.\n\r\n4.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Band Shoulder Press (Stability Ball)": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Begin by sitting on an exercise ball that is placed on top of a stretched band with a grip held in each hand and keeping your feet flat on the floor.\n\r\n2.) When balanced slowly press the bands upward so that they are elevated over your head and hold this position for a count and return back to the start.\n\r\n3.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Band Upright Row": {
        "level": "Beginner",
        "how_to_do_it": " The band upright row exercise is a great alternative to the upright row that uses dumbbells or barbells and is great for beginners or individuals just rehabilitating from injury as the bands allow you to control the resistance level.\n\r\nSteps : \n\r\n1.) Stand on the band so that the handles are level with your upper thigh.\n\r\n2.) With your back straight and abs drawn in raise your hands upward to your collarbone.\n\r\n3.) Your elbows and arms should be parallel with the floor.\n\r\n4.) Slowly lower your arms and return to starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Alternating Front and Back Press": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by sitting up straight on the end of a flat bench with your feet shoulder width apart, holding a weighted barbell at waist level with an overhand grip.\n\r\n2.) Then push the barbell up and above your head so that your arms are fully extended.\n\r\n3.) Slowly lower the bar towards your upper chest so that its almost touching then immediately push it back up to the starting position.\n\r\n4.) As soon as you reach the up position, lower the bar back down behind your neck and hold for a count.\n\r\n5.) Return back to the starting position.\n\r\n6.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Alternating Press": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Begin by standing up straight with your feet shoulder width apart, holding a weighted barbell at waist level with an overhand grip.\n\r\n2.) Then push the barbell up and above your head so that your arms are fully extended.\n\r\n3.) Slowly lower the bar towards your upper chest so that it is almost touching, then immediately push it back up to the starting position.\n\r\n4.) As soon as you reach this position, lower the bar back down behind your neck and hold for a count.\n\r\n5.) Return back to the starting position.\n\r\n6.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Bradford Rocky Press": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) To begin this exercise; start off sitting on a straight up military press bench with a weighted barbell rested on your upper chest.\n\r\n2.) Keeping your palms facing out, push the barbell up in an overhead press above your head and hold for a few seconds.\n\r\n3.) Then lower the bar down behind the back of your head and hold for a few seconds.\n\r\n4.) Return back to the overhead position and then back to the starting position.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Clean and Jerk": {
        "level": "Expert",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off with a weighted barbell in front of your feet and raise it slightly so that it is parallel with your shins. \n\r\n2.) Lower your hips and bend your knees a bit while keeping your back straight so that the weight of the bar is rested upon your heels\n\r\n3.) Pull up on the bar so that it reaches the mid-thigh position then perform a jumping movement, which you extend your knees and hips allowing the bar to move upward. \n\r\n4.) Keep the bar pressed up and rested against your palms and shoulders.\n\r\n5.) Then while in a full squat position push your torso upward thrusting with your hips, quads and heels keeping your knees bent slightly and straighten out your back.\n\r\n6.) With the barbell pressed up overhead, spread your legs out with one leg stretched out a bit forward and the other pushed back slightly maintaining the clean press overhead. \n\r\n7.) Hold onto this position for a few seconds.\n\r\n8.) Return back to the starting position by letting the barbell roll down off of your shoulders and lightly bring it back down to the floor.\n\r\n9.) Repeat this exercise for as many repetitions as needed"
      }
    },
    {
      "Barbell Frankenstein Squat": {
        "level": "Expert",
        "how_to_do_it": " Steps :\n\r\n1.) To begin this exercise; start off by placing a barbell on the front of your shoulders. \n\r\n2.) Keeping the barbell still and in place, extend your arms out in front of you so that they are parallel with the floor and at shoulder level.\n\r\n3.) Bend at the knees and lower your hips down towards the ground, keeping your chest and back straight along with the barbell secure on your shoulders. \n\r\n4.) Continue in a basic squat motion until your upper legs come in contact with your calves.\n\r\n5.) Return back to the starting position slowly with barbell in place.\n\r\n6.) Repeat this exercise for as many repetitions as needed."
      }
    }
  ],
  "Biceps": [
    {
      "Band Bicep Curl ": {
        "level": "Beginner",
        "how_to_do_it": " The speed alternating biceps curl with band exercise uses either an exercise band or bungee for resistance to help strengthen the bicep muscle.\n\r\nSteps : \n\r\n1.) Start by placing an exercise band under your feet and hold the handles palms forward in your hands.\n\r\n2.) Stand with your feet shoulder-width apart, knees slightly bent and your abs drawn in.\n\r\n3.) Curl your arms up and down in an alternating motion, keeping your body straight, and isolating the bicep muscle.\n\r\n4.) As you become comfortable with the motion, increase your speed.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Bicep Curl (Prone)": {
        "level": "Intermediate",
        "how_to_do_it": " The barbell lying high bench biceps curl exercise has you lie face down to isolate your biceps and build bigger arms.\n\r\nSteps : \n\r\n1.) Start by lying face down on a high bench with your head at one end and your toes pressed against the floor to support you.\n\r\n2.) Grab a barbell with an underhand grip (palms facing up) about 12 inches apart.\n\r\n3.) Extending your arms to the floor, curl your arms back towards your head in a slight arc, so your biceps touch your forearm.\n\r\n4.) Slowly return to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Bicep Curl (Wide Grip)": {
        "level": "Beginner",
        "how_to_do_it": " The barbell wide grip standing biceps curl exercise is a wide grip version of the bicep curl that targets the lateral (outer) portion of the bicep muscle.\n\r\nSteps : \n\r\n1.) Start by standing with your feet shoulder width apart, your knees slightly bent and your abs drawn in.\n\r\n2.) Grab a barbell with an underhand (palms up) grip as wide as you comfortably can and extend your arms fully against your thighs.\n\r\n3.) Keeping your elbows straight, raise the bar towards your chest till your forearms touch your chest, squeezing your bicep muscle.\n\r\n4.) Pause for moment and then return to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Bicep Drag Curl": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; take a barbell with palms facing forward with the barbell resting at your pelvis.\n\r\n2.) Then take the barbell and curl it towards your upper chest as in a way to “Drag” the bar up. \n\r\n3.) Hold and squeeze the biceps tightly.\n\r\n4.) Return the barbell back down to the starting position keeping the barbell in contact with your body.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Concentration Curl": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Begin by sitting on a flat bench, holding a weighted barbell in front of you, arms extended out and feet flat on the floor.\n\r\n2.) Hold the barbell with an underhand grip, palms facing up, then lean forward with your upper body so that your arms are touching your inner thighs.\n\r\n3.) Keep your legs tight against your arms throughout the exercise then slowly curl the bar up towards your shoulders, isolating the bicep, and hold for a count.\n\r\n4.) Return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired. "
      }
    },
    {
      "Barbell Concentration Curl (Close Grip)": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; sit down on a flat bench at the very edge with a barbell.\n\r\n2.) Keeping your knees bent at all times, pick up the barbell, curl the weight up and forward while squeezing and tightening your biceps as you exhale. \n\r\n3.) The only part of your body that should be moving are the forearms as they bring the barbell to shoulder level.\n\r\n4.) Hold the biceps in position for a few seconds then return back to the starting position as you inhale.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Curl": {
        "level": "Beginner",
        "how_to_do_it": " The barbell curl is a basic bicep exercise that helps increase the size of the muscles.\n\r\nSteps :\n\r\n1.) Start off standing up straight with your feet shoulder-width apart, keeping your knees slightly bent and abs drawn in tight.\n\r\n2.) Grab a barbell with a shoulder width underhand (palms up) grip, lowering your arms down to your thighs fully and bending slightly at your elbows as this will be your starting position.\n\r\n3.) Slowly raise the bar towards your upper chest, squeezing your muscles and isolating the biceps.\n\r\n4.) Hold this position for a count and then return back to the starting position.\n\r\nTips :\n\r\n1.) Refrain from swinging your hips or back during this exercise."
      }
    },
    {
      "Barbell Curl (Close Grip)": {
        "level": "Beginner",
        "how_to_do_it": " The close-grip standing barbell curl uses a barbell to help isolate the bicep during the curl.\n\r\nSteps : \n\r\n1.) Start by standing up straight with your feet shoulder width apart, keeping your knees slightly bent and abs tight.\n\r\n2.) Grab a barbell with an underhand grip and extend your arms against your thighs as this will be your starting position.\n\r\n3.) While keeping your elbows locked by your side, raise the bar up towards your chest. \n\r\n4.) Hold this position for a count and return back to the starting position."
      }
    },
    {
      "Barbell Curl Against an Incline": {
        "level": "Beginner",
        "how_to_do_it": " The barbell curls lying against an incline exercise uses an incline bench to help adjust your body's position to perform bicep curls.\n\r\nSteps : \n\r\n1.) Start by taking an incline bench and setting it to a 45-degree angle, then grabbing a barbell with a shoulder-width grip and lean forward against it with your feet resting on the floor for support.\n\r\n2.) Hang your arms down over the bench holding onto the barbell, keeping your elbows straight and raise the bar up towards your head, isolating the biceps.\n\r\n3.) Hold onto this position for a count then return back to the starting position."
      }
    },
    {
      "Barbell Drag Curl": {
        "level": "Intermediate",
        "how_to_do_it": " The barbell drag curl is a great exercise that blasts and targets the bicep muscles and even works out the forearms.\n\r\nSteps : \n\r\n1.) Start by standing with your feet shoulder-width apart, your knees slightly bent and your abs drawn in.\n\r\n2.) Grab the bar with a shoulder-width overhand grip (palms down) and extend your arms fully so they are against your thighs.\n\r\n3.) Slowly raise your arms, palms down, to touch your chest.\n\r\n4.) Return back to the starting position and repeat for as many reps and sets as desired."
      }
    }
  ],
  "Core": [
    {
      "Ab Draw Leg Slide": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying on your back with your knees bent at 90-degrees keeping your arms at your sides, palms up.\n\r\n2.) Maintaining slight pressure on your hands, extend your legs slowly forward so that you feel a stretch and a contraction in your abdominals.\n\r\n3.) Return back to the starting position and repeat for as many reps and sets desired."
      }
    },
    {
      "Ab Roll": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by sitting on the floor with your knees bent, feet planted firmly on the floor and your hands at your sides behind your knees.\n\r\n2.) Once in position rock backwards off of your pelvis towards the floor, keep your hands underneath your knees forming a \"C\" shape with your spine.\n\r\n3.) Make sure that you keep your feet planted firmly on the floor throughout the entire motion.\n\r\n4.) Squeeze with your abdominals and hold for a few seconds, then return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Abdominal Hip Roll": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying down on your back flat on the floor keeping your arms straight out and wide to your sides and feet extended out in front of you in a \"T\" position.\n\r\n2.) Slowly raise your knees up until they are at thigh level and create a 90-degree angle to the floor, then begin by twist at your hips and lowering your knees towards the floor in a pendulum motion.\n\r\n3.) Don't pause when you reach the bottom, instantly return back to the starting position and repeat in the opposite direction.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Abdominal Pendulum": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Begin by laying with your back flat on the floor, your legs together extended out in front of you and your hands placed out to your sides so that you are in a \"T\" position.\n\r\n2.) Slowly lift your legs up and over your body so that you are creating a right angle to the floor, then twisting only at your hips, lower your feet slowly to the floor to your right without losing any control.\n\r\n3.) As soon as you feel a stretch in your obliques, return to the starting position and repeat on the opposite side.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Air Bike": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start off lying flat as if you were going to perform a sit up putting your hands behind your your head and lifting your shoulders into a crunch position.\n\r\n2.) Bring your knees up so that they are perpendicular with the floor and your lower legs are parallel with the ground as this will be your starting position.\n\r\n3.) Slowly go through a cycle pedal motion kicking forward with your right leg and bringing in the knee of the left leg.\n\r\n4.) Next bring your right elbow close to your left knee by crunching to the side.\n\r\n5.) Return back to the starting position as you breathe in then crunch to the opposite side as you cycle your legs and bring your left elbow close to your right knee.\n\r\n6.) Repeat with each side for as many reps and sets as desired.\n\r\nTips : \n\r\n1.) Reduce the speed of the exercise for more intensity and better results."
      }
    },
    {
      "Alternating Arm Cobra": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start off by laying face down on the floor in a prone position with your arms at your sides.\n\r\n2.) Squeeze your glutes and lift your chest off of the floor with your arms alternately touching the floor from side to side while keeping your arms straight.\n\r\n3.) Repeat for as many reps and sets desired."
      }
    },
    {
      "Alternating Floor Leg Raise": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying with your back flat on the floor, arms at your side and feet extended out straight in front of you.\n\r\n2.) Slowly lift one of your legs up off of the floor, keeping the other one still and on the floor until your elevated foot is at a 90-degree angle with the ground.\n\r\n3.) Feel a stretch in your abdominals then return the leg back to the starting position and repeat with the opposite leg.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Alternating Heel Touch": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start off lying on the floor with your knees bent, your feet on the floor at around 18 to 24 inches apart, and your arms extended by your side.\n\r\n2.) Once in the starting position, crunch forward over your torso to the right side and touche your right heel.\n\r\n3.) Hold this position for a few seconds, squeezing your abs and then return back to the starting position.\n\r\n4.) Switch to the other side, crunching over your torso on the left side and touching your left heel, squeezing your abs and holding the contraction for a count.\n\r\n5.) Return back to the starting position and alternate sides for the desired about of reps and sets.\n"
      }
    },
    {
      "Alternating Leg Bridge": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) Start by laying on your back with arms at your sides , keeping one knee bent with your heel on the ground and the other leg pointed straight out in front of you in a 45-degree angle.\n\r\n2.) Slowly lift your hips off of the ground and squeeze your glutes.\n\r\n3.) Form a straight line with your body through your shoulders and knees.\n\r\n4.) Hold onto this position for a few seconds then return back to the starting position.\n\r\n5.) Alternate legs and repeat."
      }
    },
    {
      "Alternating Reach and Catch": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Begin by laying with your back flat on the floor, keeping your legs bent and feet planted on the floor to stabilize your body.\n\r\n2.) Then take both of your hands and place them on your right thigh until you reach your knee until you feel a stretch in your abs, then return back to the starting position.\n\r\n3.) Repeat for as many reps and sets as desired."
      }
    }
  ],
  "Back": [
    {
      "Assisted Hyperextension": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; have a partner grab your legs as your lay down on your stomach on a flat bench until your pelvis has reached the end of the bench.\n\r\n2.) Keep your body straight and cross your arms across your chest and then start to bend forward as far as you can until you can almost touch the floor.\n\r\n3.) Return back to the starting position using your torso and inhale on the way up.\n\r\n4.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Back Extension (Prone)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin the exercise; position your stomach flat on the floor with your arms extended down by your side.\n\r\n2.) With your body flat, extend your lower back and lift your chest up off of the ground. \n\r\n3.) In this process do not use your arms to push up, use your back to extend your spine up.\n\r\n4.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Back Hyperextension": {
        "level": "Beginner",
        "how_to_do_it": " This back hyper-extension exercise gives strength to the back and core muscles as well as increases flexibility.\n\r\nSteps :\n\r\n1.) Start by adjusting the hyper-extension machine so that your ankles are tucked under the footpads and thighs are across the top pad as this will be your starting position.\n\r\n2.) Keeping your arms folded across your chest and your back straight, slowly bend at your waist towards the ground until you feel a stretch in your core and lower back.\n\r\n3.) Hold for a count and then slowly return back to the starting position.\n\r\nTips : \n\r\n1.) Refrain from arching your back during this exercise."
      }
    },
    {
      "Back Stretch": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by standing up straight with your feet shoulder width apart and your hands rested upon your hips.\n\r\n2.) Slowly twist at your waist so that you feel a stretch in your middle to lower back.\n\r\n3.) Hold for 15 to 30 seconds, return to the starting position and repeat with the opposite side.\n\r\n4.) Repeat for as many reps and long as you desire."
      }
    },
    {
      "Band Row": {
        "level": "Beginner",
        "how_to_do_it": " The exercise band row is a compound bilateral exercise that works various aspects of the back and posterior shoulder. \n\r\nBegin by standing tall with your feet hip-width apart, knees soft and core engaged.\n\r\nUsing both hands, pull the band handles in towards your outer chest, pause for a 1-2 count.\n\r\nSlowly return to where arms are fully extended and repeat for desired repetitions.\n\n\n\n"
      }
    },
    {
      "Barbell Behind the Back Shrug": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off by placing a barbell behind your back resting it slightly against your quads with your palms facing backwards.\n\r\n2.) With your shoulders, raise the barbell so that it reaches your glutes and hold onto the position for a few seconds.\n\r\n3.) Return back to the starting position.\n\r\n4.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Bent-Over Row": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) To begin this exercise, stand in front of a barbell with your feet shoulder-width apart and bend over until your back is parallel with the floor.\n\r\n2.) Grab the bar with a shoulder width grip then lift the bar up off of the ground and this will be your starting position.\n\r\n3.) Take the bar and raise it up towards you chest using a controlled motion and continue until the bar is almost touching your lower chest.\n\r\n4.) Hold this position for a few seconds, squeezing your back muscles and then lower the bar back to the starting position.\n\r\nTips :\n\r\n1.) While performing this exercise keep your chin tucked and eyes looking down at the floor and your back straight.\n"
      }
    },
    {
      "Barbell Bent-Over Row (Reverse Grip)": {
        "level": "Intermediate",
        "how_to_do_it": " The Barbell Reverse Grip Bent Over Row is an excellent exercise for developing overall back strength.\n\r\nSteps : \n\r\n1.) Begin by keeping your knees slightly bent and your back straight.\n\r\n2.) Grab the barbell with a reverse (underhand) grip and pick up the barbell so it is at around shin level.\n\r\n3.) While keeping yourself bent and balanced, slowly pull the barbell up to your abs, and keeping your elbows tucked in at your sides.\n\r\n4.) Once you have reached the top of the exercise, hold for a count, squeezing your back and return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired.\n\r\nTips : \n\r\n1.) It is important to keep your back straight when you perform this exercise and if your back starts to round out, bend your knees slightly to keep it straight."
      }
    },
    {
      "Barbell Cambered Row (Prone)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start by placing a cambered or EZ bar underneath an exercise bench, then lay face down grabbing the bar with a palms down grip.\n\r\n2.) Slowly row the bar up towards your chest, keeping your elbows close to your body until you feel a tension on your lower back.\n\r\n3.) Hold this position for a count then return back to the start.\n\r\n4.) Repeat for as many reps and sets desired."
      }
    },
    {
      "Barbell Clean Deadlift": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off with a weighted barbell right in front of your shins with an overhand grip. \n\r\n2.) Bend down at the knees with your back straight, chest up, head facing forward and pull up on the barbell with the driving force from your heels.\n\r\n3.) As you lift the barbell up, keep your back straight and pull up.\n\r\n4.) When the barbell crosses your knees, lift up with your torso until the bar has reached your hips and your knees are fully extended.\n\r\n5.) Repeat this exercise for as many repetitions as needed"
      }
    }
  ],
  "Forearm": [
    {
      "Barbell Preacher Curl (Overhand)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Sit on preacher bench placing back of arms on pad. \n\r\n2.) Grasp curl bar with a shoulder-width overhand grip.\n\r\n3.) Raise bar until forearms are vertical.\n\r\n4.) Lower barbell until arm is fully extended. \n\r\n5.) Repeat for the desired amount of reps."
      }
    },
    {
      "Barbell Reverse Curl": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Stand with your feet shoulders width apart.\n\r\n2.) Bending at the knees pick up barbell.\n\r\n3.) With your palms facing downward lift the barbell to your chest while remaining up straight.\n\r\n4.) Do not bend your upper arms but bend only at your elbows, with your forearms moving.\n\r\n5.) Keep your wrist straight while raising and lowering the barbell. \n\r\n6.) Repeat for the desired amount of reps. \n\r\n7.) After the set bend at your knees to set the barbell down."
      }
    },
    {
      "Barbell Reverse Wrist Curl": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by sitting on the edge of a flat bench with a weighted barbell in your hands, arms rested on your legs and weights hanging off of your knees.\n\r\n2.) Slowly let your wrists lower down below your knees as this will be your starting position.\n\r\n3.) Using only your wrists, raise the barbell up while squeezing your forearms until you feel a stretch. \n\r\n4.) Hold for a count and then return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired.\n\r\nNotes :\n\r\n1.) It is important that you keep your arms and legs still throughout the exercise.\n\r\n2.) With this exercise you are isolating the forearms which should be the only muscle felt while performing this workout"
      }
    },
    {
      "Barbell Reverse Wrist Curl ": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by kneeling in front of a horizontal bench with your forearms resting on the padding and holding a weighted barbell in both hands with a reverse grip.\n\r\n2.) Slowly lower the barbell down below the bench as far as possible squeezing your forearms and hold for a count.\n\r\n3.) Then return back to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Wrist Curl (Palms Down)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start by picking up a barbell while kneeling over a bench.\n\r\n2.) With your palms facing downwards flex each forearm by lifting and lowering the barbell with only your wrist.\n\r\n3.) Exhale while raising your wrist.  \n\r\n4.) Inhale while lowering your wrist.  \n\r\n5.) Repeat for the desired amount of reps."
      }
    },
    {
      "Barbell Wrist Curl (Palms Down)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start by placing the barbell on the floor in front of a flat bench.\n\r\n2.) Sit down on the bench with your legs shoulder width apart.\n\r\n3.) Use your hands to grab the barbell and bring it up so that your forearms are resting against your thighs with palms downward. \n\r\n4.) Start out by curling your wrist upwards and exhaling.\n\r\n5.) Slowly lower your wrist back down to the starting position while inhaling. (Do not move your arms or legs during the exercise.)\n\r\n6.) Repeat for the desired amount of reps."
      }
    },
    {
      "Barbell Wrist Curl (Palms Up)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start by picking up a barbell while kneeling over a bench.\n\r\n2.) With your palms facing upwards, flex each forearm by lifting and lowering the barbell with only your wrist.\n\r\n3.) Exhale while raising your wrist.\n\r\n4.) Inhale while lowering your wrist.  \n\r\n5.) Repeat for the desired amount of reps and sets."
      }
    },
    {
      "Barbell Wrist Curl (Palms Up)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Start out by placing the barbell on the floor in front of a flat bench.\n\r\n2.) Sit down on the bench with your legs shoulder width apart.\n\r\n3.) Use your hands to grab the barbell and bring it up so that your forearms are resting against your thighs with palms upward. \n\r\n4.) Start out by curling your wrist upwards and exhaling.\n\r\n5.) Slowly lower your wrist back down to the starting position while inhaling.\n\r\n6.) Repeat for the desired amount of repetitions and sets.\n\n\r\nTips :\n\r\n1.) Refrain from moving your forearms during this exercise."
      }
    },
    {
      "Barbell Wrist Curl (Posterior)": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) Stand with your feet shoulders width apart.  \n\r\n2.) Grasp the barbell in your hands with your palms facing outwards.  \n\r\n3.) Lift the barbell up and down using only your hands while keeping your arms straight.  "
      }
    },
    {
      "Cable Behind the Back Wrist Curl": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by setting up either a straight or EZ bar on a low pulley cable machine and grab the bar behind your back using an underhand shoulder width grip.\n\r\n2.) Keep your elbows tucked in at your sides and slowly raise the bar up, squeezing your forearms and hold for a count.\n\r\n3.) Return back to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    }
  ],
  "Upper Legs": [
    {
      "90/90 Hamstring Stretch": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off lying flat on your back with one leg extended out and with your other leg bend it and grab the knee with your hands.\n\r\n2.) Take the leg that is being bent and extend it straight into the air and hold onto the position for up to 15 seconds and then alternate legs.\n\r\n3.) Repeat this exercise for as many repetitions as needed"
      }
    },
    {
      "All Fours Quad Stretch": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off in a kneeling pushing position and lift your right leg off of the floor and hold onto it with your right hand.\n\r\n2.) With your hand hold onto your ankle and stretch out your upper legs holding on for 15 to 30 seconds, then alternate.\n\r\n3.) Repeat this exercise for as many repetitions as needed"
      }
    },
    {
      "Alternating Diagonal Leg Bound": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start in a stance at an end of a room with one foot in front of the other.\n\r\n2.) Push off with your front leg with as much force as possible, driving your opposite knee up and forward, landing with your front foot.\n\r\n3.) Then repeat with the opposite leg and push with as much force as possible cover as much distance as you can.\n\r\n4.) Repeat for as many reps and sets as you desire."
      }
    },
    {
      "Band Good Morning": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off standing on a band, wrapping it around your neck and making sure that it is evenly distributed for stretching in each arm.\n\r\n2.) Bend at the knees and extend down with your hips then straighten out your legs and come to a vertical position.\n\r\n3.) Repeat this exercise for as many repetitions as needed"
      }
    },
    {
      "Band Hamstring Stretch": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by laying with your back flat on the ground with one leg extended above you and the other kept straight and flat on the floor.\n\r\n2.) Take either a belt, rope or exercise band and loop it around the ball of your foot, then pull on the belt to put tension on your calves and hamstrings.\n\r\n3.) Hold this position for 15 to 30 seconds then return to the start.\n\r\n4.) Repeat for as many reps and however long you desire."
      }
    },
    {
      "Band Quad Stretch": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by sitting on the ground and looping a band, rope or belt around one foot.\n\r\n2.) Twist your body over to your stomach and lay flat face down on the floor and flex the knee with the band wrapped around it, keeping the other fully extended behind you.\n\r\n3.) By pulling on the band, your hip and knee should come up off of the floor creating tension in your quads and hip flexors.\n\r\n4.) Hold this stretch for 15 to 30 seconds and return to the starting position.\n\r\n5.) Repeat for as many reps, sets and however long you desire."
      }
    },
    {
      "Band Squat": {
        "level": "Beginner",
        "how_to_do_it": " The band squat exercise is the version of the squat that uses exercise bands to increase resistance and flexibility instead of using weights.\n\r\nSteps : \n\r\n1.) Start off standing with your feet on the exercise bands with your feet shoulder width apart.\n\r\n2.) Grab onto the handles of the bands and pull them up to your shoulders in a slow and controlled motion.\n\r\n3.) With your abs drawn in, squat down until your thighs are parallel with the floor.\n\r\n4.) Slowly return to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired.\n"
      }
    },
    {
      "Barbell 1/2 Squat": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by setting up a weighted barbell with the amount of weight that you would like to perform.\n\r\n2.) Position the barbell on your shoulders with an overhand wide shoulder width grip just as in a regular squat position.\n\r\n3.) Slowly squat down towards the floor about 12 inches, not as deep as a regular squat, and hold for a count.\n\r\n4.) Return back up to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell 1/4 Squat": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by setting up a barbell with the amount of weight that you would like to perform for this exercise and placing it on your shoulder blades just as if you were to be performing a squat.\n\r\n2.) Place your hands in a shoulder width overhand grip and keep your knees slightly bent.\n\r\n3.) Slowly lower and squat yourself down towards the ground about 6 to 12 inches and hold for a count.\n\r\n4.) Return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Bench Squat ": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) To begin this exercise; start off with a weighted barbell rested upon your shoulders behind your neck.\n\r\n2.) Bend at your knees and start to sit back with your hips as you go down for a standard squat, keeping your back and chest straight out. \n\r\n3.) Continue on with the squat until your hamstrings and glutes are rested upon the box and hold on for a few seconds.\n\r\n4.) Then using the force of your heels and lower legs, straighten out and extend your hips to get back to your starting position.\n\r\n5.) Repeat this exercise for as many repetitions as needed"
      }
    }
  ],
  "Glutes": [
    {
      "Band Hip Lift": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; take a band and secure it underneath two dumbbells so that they wont move.\n\r\n2.) Move your body so that your hips are right under the bands and set up for a basic sit up position with your knees up and feet firm on the floor. \n\r\n3.) Keep your hands extended behind your head.\n\r\n4.) Push your shoulders to the floor as you raise your hips and extend the band as high as possible. \n\r\n5.) Hold onto the position for a few seconds and return to the start.\n\r\n6.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Glute Bridge": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To start this exercise; begin with your back flat on the floor and a weighted barbell above your legs. \n\r\n2.) Roll the bar so that it is resting above the top of your thighs at the increase in the hip.\n\r\n3.) With the bar upon your hips, extend upward with your back and heels supporting the weight of the bar.\n\r\n4.) Push the bar up as high a possible then return back to the starting position.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Hip Thrust": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off with your body seated on the ground with your back rested upon a bench. \n\r\n2.) Keep a weighted barbell above your hips as this will be your starting position.\n\r\n3.) Lean your back against the bench and rest your shoulders on the top of it.\n\r\n4.) Then push your hips up vertically and keep the bar rested in your pelvis region, your back and heels should support the weight of the bar.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Kneeling Jump Squat": {
        "level": "Expert",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off in a kneeling position on the floor with a weighted barbell rested upon your shoulders.\n\r\n2.) Lean back with your pelvis and let your butt touch your feet then explode forward and up with your hips with enough power that allows you to lift your feet up off of the floor and land flat.\n\r\n3.) Then push your body up into a full standing position.\n\r\n4.) Repeat this exercise for as many repetitions as needed.\n\r\nTips :\n\r\n1.) Make sure that you are doing the exercise with as much weight as you are able to handle."
      }
    },
    {
      "Barbell Kneeling Squat": {
        "level": "Intermediate",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off in a kneeling position with a weighted barbell upon your shoulders.\n\r\n2.) Lean back with your pelvis and touch your calves with your glutes and then return back to the starting position.\n\r\n3.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Barbell Lateral Lunge": {
        "level": "Intermediate",
        "how_to_do_it": " Steps :\n\r\n1.) Start by standing up straight with your feet about shoulder width apart, holding a barbell across your upper back with hands wider than your shoulders.\n\r\n2.) Then take a short lateral step in one direction, sitting back while bending at one knee until you feel a stretch in your thighs.\n\r\n3.) Hold onto this position for a count then return back up to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Bridge": {
        "level": "Beginner",
        "how_to_do_it": " The bridge exercise is a great exercise to help build and maintain core strength\n\r\nSteps :\n\r\n1.) Start by lying on your back with your knees bent and your feet flat on the floor.\n\r\n2.) Lift up your hips off the floor as you draw your abs in and keep your glutes tight.\n\r\n3.) Hold the position for a count then return back to the start.\n\r\n4.) Repeat for as many sets as desired."
      }
    },
    {
      "Cable Hip Abduction": {
        "level": "Beginner",
        "how_to_do_it": " The hip adduction exercise helps strengthen the hip flexor and thigh muscles.\n\r\nSteps :\n\r\n1.) Start by standing alongside a cable pulley stack and attach a cuff to the pulley near your ankle.\n\r\n2.) Step away from the stack holding onto the stack for support.\n\r\n3.) While standing firm on the foot not attached to the cable, slowly abduct (pull away) your cuffed ankle in front of your stabilizing leg and back.\n\r\n4.) Repeat and switch ankles."
      }
    },
    {
      "Cable Leg Kickback": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by setting up an ankle strap or cable onto a low pulley cable machine and attaching it to one of your ankles.\n\r\n2.) Stand in front of the machine and place your arms against it for support.\n\r\n3.) Slowly move the weighted leg backward, extending it as far as you can, feeling a stretch in your calf and hold for a count.\n\r\n4.) Return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Cable Pull Through": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) To begin this exercise; start off standing only a few feet from the cable machine holding the rope in between your legs just underneath your glutes.\n\r\n2.) Then take the rope, keeping your knees slightly bent, pull the rope through with only the use of your hips. \n\r\n3.) Refrain from using your shoulders or arms to pull.\n\r\n4.) Repeat this exercise for as many repetitions as needed."
      }
    }
  ],
  "Cardio": [
    {
      "Aerobics": {
        "level": "Beginner",
        "how_to_do_it": " Aerobic Exercise focuses upon cardiovascular fitness, muscle strength and endurance by performing aerobic workouts."
      }
    },
    {
      "Boxing": {
        "level": "Beginner",
        "how_to_do_it": " Boxing is a combat sport in which two people fight one another with their fists, it is a great exercise that helps increase stamina, agility and strength while also helping you lose weight and tone your body."
      }
    },
    {
      "Elliptical Training": {
        "level": "Beginner",
        "how_to_do_it": " The elliptical is a stationary exercise machine used to simulate walking, running or stair climbing.\n\r\nYou are able to burn a significant amount of calories, tone up, increase endurance and strength and build power calf and abdominal muscles through the use of an elliptical"
      }
    },
    {
      "Field Sports": {
        "level": "Beginner",
        "how_to_do_it": " Field sports are any sports that are performed outdoors such as lacrosse.\n\r\nThese sports can help increase endurance, agility, flexibility, stamina as well as burn calories, lose weight and tone up the body."
      }
    },
    {
      "Indoor Cycling": {
        "level": "Beginner",
        "how_to_do_it": " Indoor cycling is a form of exercise that focuses on endurance, stamina, strength, intensity, intervals and recovery"
      }
    },
    {
      "Inline Skating": {
        "level": "Beginner",
        "how_to_do_it": " Inline skating is a sport that helps tone your body, build a strong core and muscles, burn calories, increases endurance and stamina as well as improve coordination and balance."
      }
    },
    {
      "Jump Rope": {
        "level": "Intermediate",
        "how_to_do_it": " Jumping rope is a great cardio exercise that helps burn a significant amount of calories through repeated jumping motion keeping the body in motion.\n\r\nThis exercise helps condition the body for strenuous activity along with increasing endurance, stamina, building strength in the leg muscles and core, and loosening up for other activities."
      }
    },
    {
      "Mountain Biking": {
        "level": "Beginner",
        "how_to_do_it": " Mountain bikin is a sport that consists of riding outdoors, mostly off-road courses and over rough terrain.\n\r\nIt requires stamina, core strength, endurance, balance, coordination and handling skills."
      }
    },
    {
      "Pilates": {
        "level": "Beginner",
        "how_to_do_it": " Pilates are an exercise that focus upon developing strength through the core of the body as well as increasing flexibility and coordination."
      }
    },
    {
      "Recumbent Bike": {
        "level": "Beginner",
        "how_to_do_it": " The recumbent bike is a great cardio exercise. It is a variation of a cardio workout that involves the recumbent bicycle that places the individual in a laid back reclining position.\n\r\nIt is a great exercise for burning calories, increasing stamina and endurance, improving balance and helps build core and lower leg strength."
      }
    }
  ],
  "Lower Legs": [
    {
      "Ankle Circles": {
        "level": "Beginner",
        "how_to_do_it": " The ankle circles exercise is the most simple workout for the calves to loosen the joints and strengthen and improve flexibility within the muscle.\n\r\nSteps :\n\r\n1.) Start by standing on one foot near a chair or wall for support.\n\r\n2.) Lift your foot off the ground and draw circles clockwise in the air with your toes.\n\r\n3.) Reverse the direction (counter-clockwise) and switch feet."
      }
    },
    {
      "Band Calf Raise": {
        "level": "Beginner",
        "how_to_do_it": " Steps : \n\r\n1.) To begin this exercise; start off with taking an exercise and standing on it with equal amount of band on both sides.\n\r\n2.) Taking the handles of the bands, elevate your arms towards the side of your head so that the bands tighten up.\n\r\n3.) Then while leaving your hands by your head, stand on your toes and squeeze tightly on your calves.\n\r\n4.) After holding on for a few seconds, release and go back to the starting position with your hands still by your head.\n\r\n5.) Repeat this exercise for as many repetitions as needed."
      }
    },
    {
      "Band Calf Raise": {
        "level": "Beginner",
        "how_to_do_it": " The band calf raise exercise uses a band to create resistance in the calf muscle\n\r\nSteps : \n\r\n1.) Start by standing up straight with your toes on an exercise band and raise the handles up to your shoulders.\n\r\n2.) Raise up on your toes, keeping your hands up by your shoulders, feeling a stretch in your calf muscles.\n\r\n3.) Pause for a moment and then lower your heel to the floor.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Band Seated Calf Stretch": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by sitting up straight with your legs extended out in front of you.\n\r\n2.) Slowly bend one knee back toward you and placing your foot on the floor to stabilize your body.\n\r\n3.) With the other leg keep it extended and flex your ankle so that the toes are pointed in towards your body.\n\r\n4.) Either using an exercise band, towel, belt or even your own hand pull your toes towards you until you feel a stretch in your calves and hold this position for 15 to 30 seconds.\n\r\n5.) Return to the starting position and repeat for as many reps, sets and duration as desired."
      }
    },
    {
      "Barbell Calf Raise": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Begin by setting up a barbell with the amount of weight that you would like to use for this exercise and rest the barbell across the top of your upper back.\n\r\n2.) Slowly lean forward and raise your heels up off of the floor, pushing up as high as possible squeezing your calves at the top of the movement.\n\r\n3.) Hold for a two count then return back to the starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Rocking Standing Calf Raise": {
        "level": "Intermediate",
        "how_to_do_it": " The rocking standing calf raise exercise uses a simple rocking motion to help strengthen the calves.\n\r\nSteps : \n\r\n1.) Start by standing up straight with a bar across your shoulders.\n\r\n2.) With your feet flat on the floor, lift your feet up and forward as if you are performing a calf raise and then rock back onto your ankles so your toes are flexed and off the floor.\n\r\n3.) Return to starting position.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Seated Calf Raise": {
        "level": "Beginner",
        "how_to_do_it": " The barbell seated calf raise is a version of the standard calf raise that uses a block and barbell.\n\r\nSteps : \n\r\n1.) Start by placing a block on the floor about one foot in front of a bench.\n\r\n2.) Rest a barbell across your upper thighs and then sit on the bench with the balls of your feet placed upon the block.\n\r\n3.) While keeping the barbell rested across your thighs, slowly raise and lower your heels up as high as possible without lifting your foot off of the block.\n\r\n4.) Repeat for as many reps and sets as desired."
      }
    },
    {
      "Barbell Standing Calf Raise": {
        "level": "Intermediate",
        "how_to_do_it": " The standing barbell calf raise helps target the lower leg muscles and build stronger legs.\n\r\nSteps : \n\r\n1.) Start of by placing a block or two free weight plates on the floor, then placing a weighted barbell across your back and step up so that the balls of your feet are on the block.\n\r\n2.) Slowly lift your heels up off of the floor and then lower them back so that you feel as much of a stretch as possible in your calf muscles.\n\r\n3.) Return to the starting position and repeat for as many reps and sets as desired."
      }
    },
    {
      "Bench Calf Stretch": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by placing a bench, step or platform in front of your body then taking your right heel and placing it on top of the platform.\n\r\n2.) Lean forward with your upper body and grab onto your right toe with your right hand, keeping your left leg bent behind you and straight.\n\r\n3.) Take your left hand, place it on your left thigh to help support the extra weight placed upon your left leg.\n\r\n4.) Keep pulling your toes until you feel a stretch in your calf then hold this position for 15 to 30 seconds.\n\r\n5.) Return back to the starting position and repeat for as many reps, sets and however long you desire."
      }
    },
    {
      "Bodyweight Calf Raise": {
        "level": "Beginner",
        "how_to_do_it": " Steps :\n\r\n1.) Start by setting up either a step or a block next to either a support structure or smith machine.\n\r\n2.) Place the balls of your feet on the edge of the block/step and let your heels drop down towards the floor as far as possible.\n\r\n3.) Then slowly raise your heels up as high as possible, squeezing your calves and hold for a count.\n\r\n4.) Return back to the starting position.\n\r\n5.) Repeat for as many reps and sets as desired."
      }
    }
  ]
}